### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.github_repository["grc.grc-1"].github_branch_protection.branch["develop"] will be created
+   resource "github_branch_protection" "branch" {
+       allows_deletions                = false
+       allows_force_pushes             = false
+       enforce_admins                  = false
+       id                              = (known after apply)
+       pattern                         = "develop"
+       repository_id                   = (known after apply)
+       require_conversation_resolution = false
+       require_signed_commits          = false
+       required_linear_history         = false

+       required_pull_request_reviews {
+           dismiss_stale_reviews           = false
+           require_code_owner_reviews      = false
+           required_approving_review_count = 2
+           restrict_dismissals             = false
        }
    }

  # module.github_repository["grc.grc-1"].github_branch_protection.branch["main"] will be created
+   resource "github_branch_protection" "branch" {
+       allows_deletions                = false
+       allows_force_pushes             = false
+       enforce_admins                  = false
+       id                              = (known after apply)
+       pattern                         = "main"
+       repository_id                   = (known after apply)
+       require_conversation_resolution = false
+       require_signed_commits          = false
+       required_linear_history         = false

+       required_pull_request_reviews {
+           dismiss_stale_reviews           = false
+           require_code_owner_reviews      = false
+           required_approving_review_count = 2
+           restrict_dismissals             = false
        }
    }

  # module.github_repository["grc.grc-1"].github_branch_protection.branch["master"] will be created
+   resource "github_branch_protection" "branch" {
+       allows_deletions                = false
+       allows_force_pushes             = false
+       enforce_admins                  = false
+       id                              = (known after apply)
+       pattern                         = "master"
+       repository_id                   = (known after apply)
+       require_conversation_resolution = false
+       require_signed_commits          = false
+       required_linear_history         = false

+       required_pull_request_reviews {
+           dismiss_stale_reviews           = false
+           require_code_owner_reviews      = false
+           required_approving_review_count = 2
+           restrict_dismissals             = false
        }
    }

  # module.github_repository["grc.grc-1"].github_repository.repo will be created
+   resource "github_repository" "repo" {
+       allow_auto_merge       = false
+       allow_merge_commit     = true
+       allow_rebase_merge     = true
+       allow_squash_merge     = true
+       archived               = false
+       auto_init              = true
+       branches               = (known after apply)
+       default_branch         = (known after apply)
+       delete_branch_on_merge = false
+       etag                   = (known after apply)
+       full_name              = (known after apply)
+       git_clone_url          = (known after apply)
+       has_downloads          = false
+       has_issues             = false
+       has_projects           = false
+       has_wiki               = false
+       html_url               = (known after apply)
+       http_clone_url         = (known after apply)
+       id                     = (known after apply)
+       is_template            = false
+       name                   = "grc-1"
+       node_id                = (known after apply)
+       private                = (known after apply)
+       repo_id                = (known after apply)
+       ssh_clone_url          = (known after apply)
+       svn_url                = (known after apply)
+       visibility             = "public"
+       vulnerability_alerts   = true
    }

  # module.github_repository["grc.grc-10"].github_branch_protection.branch["develop"] will be created
+   resource "github_branch_protection" "branch" {
+       allows_deletions                = false
+       allows_force_pushes             = false
+       enforce_admins                  = false
+       id                              = (known after apply)
+       pattern                         = "develop"
+       repository_id                   = (known after apply)
+       require_conversation_resolution = false
+       require_signed_commits          = false
+       required_linear_history         = false

+       required_pull_request_reviews {
+           dismiss_stale_reviews           = false
+           require_code_owner_reviews      = false
+           required_approving_review_count = 2
+           restrict_dismissals             = false
        }
    }

  # module.github_repository["grc.grc-10"].github_branch_protection.branch["main"] will be created
+   resource "github_branch_protection" "branch" {
+       allows_deletions                = false
+       allows_force_pushes             = false
+       enforce_admins                  = false
+       id                              = (known after apply)
+       pattern                         = "main"
+       repository_id                   = (known after apply)
+       require_conversation_resolution = false
+       require_signed_commits          = false
+       required_linear_history         = false

+       required_pull_request_reviews {
+           dismiss_stale_reviews           = false
+           require_code_owner_reviews      = false
+           required_approving_review_count = 2
+           restrict_dismissals             = false
        }
    }

  # module.github_repository["grc.grc-10"].github_branch_protection.branch["master"] will be created
+   resource "github_branch_protection" "branch" {
+       allows_deletions                = false
+       allows_force_pushes             = false
+       enforce_admins                  = false
+       id                              = (known after apply)
+       pattern                         = "master"
+       repository_id                   = (known after apply)
+       require_conversation_resolution = false
+       require_signed_commits          = false
+       required_linear_history         = false

+       required_pull_request_reviews {
+           dismiss_stale_reviews           = false
+           require_code_owner_reviews      = false
+           required_approving_review_count = 2
+           restrict_dismissals             = false
        }
    }

  # module.github_repository["grc.grc-10"].github_repository.repo will be created
+   resource "github_repository" "repo" {
+       allow_auto_merge       = false
+       allow_merge_commit     = true
+       allow_rebase_merge     = true
+       allow_squash_merge     = true
+       archived               = false
+       auto_init              = true
+       branches               = (known after apply)
+       default_branch         = (known after apply)
+       delete_branch_on_merge = false
+       etag                   = (known after apply)
+       full_name              = (known after apply)
+       git_clone_url          = (known after apply)
+       has_downloads          = false
+       has_issues             = false
+       has_projects           = false
+       has_wiki               = false
+       html_url               = (known after apply)
+       http_clone_url         = (known after apply)
+       id                     = (known after apply)
+       is_template            = false
+       name                   = "grc-10"
+       node_id                = (known after apply)
+       private                = (known after apply)
+       repo_id                = (known after apply)
+       ssh_clone_url          = (known after apply)
+       svn_url                = (known after apply)
+       visibility             = "public"
+       vulnerability_alerts   = true
    }

  # module.github_repository["grc.grc-11"].github_branch_protection.branch["develop"] will be created
+   resource "github_branch_protection" "branch" {
+       allows_deletions                = false
+       allows_force_pushes             = false
+       enforce_admins                  = false
+       id                              = (known after apply)
+       pattern                         = "develop"
+       repository_id                   = (known after apply)
+       require_conversation_resolution = false
+       require_signed_commits          = false
+       required_linear_history         = false

+       required_pull_request_reviews {
+           dismiss_stale_reviews           = false
+           require_code_owner_reviews      = false
+           required_approving_review_count = 2
+           restrict_dismissals             = false
        }
    }

  # module.github_repository["grc.grc-11"].github_branch_protection.branch["main"] will be created
+   resource "github_branch_protection" "branch" {
+       allows_deletions                = false
+       allows_force_pushes             = false
+       enforce_admins                  = false
+       id                              = (known after apply)
+       pattern                         = "main"
+       repository_id                   = (known after apply)
+       require_conversation_resolution = false
+       require_signed_commits          = false
+       required_linear_history         = false

+       required_pull_request_reviews {
+           dismiss_stale_reviews           = false
+           require_code_owner_reviews      = false
+           required_approving_review_count = 2
+           restrict_dismissals             = false
        }
    }

  # module.github_repository["grc.grc-11"].github_branch_protection.branch["master"] will be created
+   resource "github_branch_protection" "branch" {
+       allows_deletions                = false
+       allows_force_pushes             = false
+       enforce_admins                  = false
+       id                              = (known after apply)
+       pattern                         = "master"
+       repository_id                   = (known after apply)
+       require_conversation_resolution = false
+       require_signed_commits          = false
+       required_linear_history         = false

+       required_pull_request_reviews {
+           dismiss_stale_reviews           = false
+           require_code_owner_reviews      = false
+           required_approving_review_count = 2
+           restrict_dismissals             = false
        }
    }

  # module.github_repository["grc.grc-11"].github_repository.repo will be created
+   resource "github_repository" "repo" {
+       allow_auto_merge       = false
+       allow_merge_commit     = true
+       allow_rebase_merge     = true
+       allow_squash_merge     = true
+       archived               = false
+       auto_init              = true
+       branches               = (known after apply)
+       default_branch         = (known after apply)
+       delete_branch_on_merge = false
+       etag                   = (known after apply)
+       full_name              = (known after apply)
+       git_clone_url          = (known after apply)
+       has_downloads          = false
+       has_issues             = false
+       has_projects           = false
+       has_wiki               = false
+       html_url               = (known after apply)
+       http_clone_url         = (known after apply)
+       id                     = (known after apply)
+       is_template            = false
+       name                   = "grc-11"
+       node_id                = (known after apply)
+       private                = (known after apply)
+       repo_id                = (known after apply)
+       ssh_clone_url          = (known after apply)
+       svn_url                = (known after apply)
+       visibility             = "public"
+       vulnerability_alerts   = true
    }

  # module.github_repository["grc.grc-2"].github_branch_protection.branch["develop"] will be created
+   resource "github_branch_protection" "branch" {
+       allows_deletions                = false
+       allows_force_pushes             = false
+       enforce_admins                  = false
+       id                              = (known after apply)
+       pattern                         = "develop"
+       repository_id                   = (known after apply)
+       require_conversation_resolution = false
+       require_signed_commits          = false
+       required_linear_history         = false

+       required_pull_request_reviews {
+           dismiss_stale_reviews           = false
+           require_code_owner_reviews      = false
+           required_approving_review_count = 5
+           restrict_dismissals             = false
        }
    }

  # module.github_repository["grc.grc-2"].github_branch_protection.branch["main"] will be created
+   resource "github_branch_protection" "branch" {
+       allows_deletions                = false
+       allows_force_pushes             = false
+       enforce_admins                  = false
+       id                              = (known after apply)
+       pattern                         = "main"
+       repository_id                   = (known after apply)
+       require_conversation_resolution = false
+       require_signed_commits          = false
+       required_linear_history         = false

+       required_pull_request_reviews {
+           dismiss_stale_reviews           = false
+           require_code_owner_reviews      = false
+           required_approving_review_count = 5
+           restrict_dismissals             = false
        }
    }

  # module.github_repository["grc.grc-2"].github_branch_protection.branch["master"] will be created
+   resource "github_branch_protection" "branch" {
+       allows_deletions                = false
+       allows_force_pushes             = false
+       enforce_admins                  = false
+       id                              = (known after apply)
+       pattern                         = "master"
+       repository_id                   = (known after apply)
+       require_conversation_resolution = false
+       require_signed_commits          = false
+       required_linear_history         = false

+       required_pull_request_reviews {
+           dismiss_stale_reviews           = false
+           require_code_owner_reviews      = false
+           required_approving_review_count = 5
+           restrict_dismissals             = false
        }
    }

  # module.github_repository["grc.grc-2"].github_repository.repo will be created
+   resource "github_repository" "repo" {
+       allow_auto_merge       = false
+       allow_merge_commit     = true
+       allow_rebase_merge     = true
+       allow_squash_merge     = true
+       archived               = false
+       auto_init              = true
+       branches               = (known after apply)
+       default_branch         = (known after apply)
+       delete_branch_on_merge = false
+       etag                   = (known after apply)
+       full_name              = (known after apply)
+       git_clone_url          = (known after apply)
+       has_downloads          = false
+       has_issues             = false
+       has_projects           = false
+       has_wiki               = false
+       html_url               = (known after apply)
+       http_clone_url         = (known after apply)
+       id                     = (known after apply)
+       is_template            = false
+       name                   = "grc-2"
+       node_id                = (known after apply)
+       private                = (known after apply)
+       repo_id                = (known after apply)
+       ssh_clone_url          = (known after apply)
+       svn_url                = (known after apply)
+       visibility             = "public"
+       vulnerability_alerts   = true
    }

  # module.github_repository["grc.grc-6"].github_branch_protection.branch["develop"] will be created
+   resource "github_branch_protection" "branch" {
+       allows_deletions                = false
+       allows_force_pushes             = false
+       enforce_admins                  = false
+       id                              = (known after apply)
+       pattern                         = "develop"
+       repository_id                   = (known after apply)
+       require_conversation_resolution = false
+       require_signed_commits          = false
+       required_linear_history         = false

+       required_pull_request_reviews {
+           dismiss_stale_reviews           = false
+           require_code_owner_reviews      = false
+           required_approving_review_count = 2
+           restrict_dismissals             = false
        }
    }

  # module.github_repository["grc.grc-6"].github_branch_protection.branch["main"] will be created
+   resource "github_branch_protection" "branch" {
+       allows_deletions                = false
+       allows_force_pushes             = false
+       enforce_admins                  = false
+       id                              = (known after apply)
+       pattern                         = "main"
+       repository_id                   = (known after apply)
+       require_conversation_resolution = false
+       require_signed_commits          = false
+       required_linear_history         = false

+       required_pull_request_reviews {
+           dismiss_stale_reviews           = false
+           require_code_owner_reviews      = false
+           required_approving_review_count = 2
+           restrict_dismissals             = false
        }
    }

  # module.github_repository["grc.grc-6"].github_branch_protection.branch["master"] will be created
+   resource "github_branch_protection" "branch" {
+       allows_deletions                = false
+       allows_force_pushes             = false
+       enforce_admins                  = false
+       id                              = (known after apply)
+       pattern                         = "master"
+       repository_id                   = (known after apply)
+       require_conversation_resolution = false
+       require_signed_commits          = false
+       required_linear_history         = false

+       required_pull_request_reviews {
+           dismiss_stale_reviews           = false
+           require_code_owner_reviews      = false
+           required_approving_review_count = 2
+           restrict_dismissals             = false
        }
    }

  # module.github_repository["grc.grc-6"].github_repository.repo will be created
+   resource "github_repository" "repo" {
+       allow_auto_merge       = false
+       allow_merge_commit     = true
+       allow_rebase_merge     = true
+       allow_squash_merge     = true
+       archived               = false
+       auto_init              = true
+       branches               = (known after apply)
+       default_branch         = (known after apply)
+       delete_branch_on_merge = false
+       etag                   = (known after apply)
+       full_name              = (known after apply)
+       git_clone_url          = (known after apply)
+       has_downloads          = false
+       has_issues             = false
+       has_projects           = false
+       has_wiki               = false
+       html_url               = (known after apply)
+       http_clone_url         = (known after apply)
+       id                     = (known after apply)
+       is_template            = false
+       name                   = "grc-6"
+       node_id                = (known after apply)
+       private                = (known after apply)
+       repo_id                = (known after apply)
+       ssh_clone_url          = (known after apply)
+       svn_url                = (known after apply)
+       visibility             = "public"
+       vulnerability_alerts   = true
    }

  # module.github_repository["wfm.wfm-1"].github_branch_protection.branch["develop"] will be created
+   resource "github_branch_protection" "branch" {
+       allows_deletions                = false
+       allows_force_pushes             = false
+       enforce_admins                  = false
+       id                              = (known after apply)
+       pattern                         = "develop"
+       repository_id                   = (known after apply)
+       require_conversation_resolution = false
+       require_signed_commits          = false
+       required_linear_history         = false

+       required_pull_request_reviews {
+           dismiss_stale_reviews           = false
+           require_code_owner_reviews      = false
+           required_approving_review_count = 2
+           restrict_dismissals             = false
        }
    }

  # module.github_repository["wfm.wfm-1"].github_branch_protection.branch["main"] will be created
+   resource "github_branch_protection" "branch" {
+       allows_deletions                = false
+       allows_force_pushes             = false
+       enforce_admins                  = false
+       id                              = (known after apply)
+       pattern                         = "main"
+       repository_id                   = (known after apply)
+       require_conversation_resolution = false
+       require_signed_commits          = false
+       required_linear_history         = false

+       required_pull_request_reviews {
+           dismiss_stale_reviews           = false
+           require_code_owner_reviews      = false
+           required_approving_review_count = 2
+           restrict_dismissals             = false
        }
    }

  # module.github_repository["wfm.wfm-1"].github_branch_protection.branch["master"] will be created
+   resource "github_branch_protection" "branch" {
+       allows_deletions                = false
+       allows_force_pushes             = false
+       enforce_admins                  = false
+       id                              = (known after apply)
+       pattern                         = "master"
+       repository_id                   = (known after apply)
+       require_conversation_resolution = false
+       require_signed_commits          = false
+       required_linear_history         = false

+       required_pull_request_reviews {
+           dismiss_stale_reviews           = false
+           require_code_owner_reviews      = false
+           required_approving_review_count = 2
+           restrict_dismissals             = false
        }
    }

  # module.github_repository["wfm.wfm-1"].github_repository.repo will be created
+   resource "github_repository" "repo" {
+       allow_auto_merge       = false
+       allow_merge_commit     = true
+       allow_rebase_merge     = true
+       allow_squash_merge     = true
+       archived               = false
+       auto_init              = true
+       branches               = (known after apply)
+       default_branch         = (known after apply)
+       delete_branch_on_merge = false
+       etag                   = (known after apply)
+       full_name              = (known after apply)
+       git_clone_url          = (known after apply)
+       has_downloads          = false
+       has_issues             = false
+       has_projects           = false
+       has_wiki               = false
+       html_url               = (known after apply)
+       http_clone_url         = (known after apply)
+       id                     = (known after apply)
+       is_template            = false
+       name                   = "wfm-1"
+       node_id                = (known after apply)
+       private                = (known after apply)
+       repo_id                = (known after apply)
+       ssh_clone_url          = (known after apply)
+       svn_url                = (known after apply)
+       visibility             = "public"
+       vulnerability_alerts   = true
    }

  # module.github_repository["wfm.wfm-10"].github_branch_protection.branch["develop"] will be created
+   resource "github_branch_protection" "branch" {
+       allows_deletions                = false
+       allows_force_pushes             = false
+       enforce_admins                  = false
+       id                              = (known after apply)
+       pattern                         = "develop"
+       repository_id                   = (known after apply)
+       require_conversation_resolution = false
+       require_signed_commits          = false
+       required_linear_history         = false

+       required_pull_request_reviews {
+           dismiss_stale_reviews           = false
+           require_code_owner_reviews      = false
+           required_approving_review_count = 2
+           restrict_dismissals             = false
        }
    }

  # module.github_repository["wfm.wfm-10"].github_branch_protection.branch["main"] will be created
+   resource "github_branch_protection" "branch" {
+       allows_deletions                = false
+       allows_force_pushes             = false
+       enforce_admins                  = false
+       id                              = (known after apply)
+       pattern                         = "main"
+       repository_id                   = (known after apply)
+       require_conversation_resolution = false
+       require_signed_commits          = false
+       required_linear_history         = false

+       required_pull_request_reviews {
+           dismiss_stale_reviews           = false
+           require_code_owner_reviews      = false
+           required_approving_review_count = 2
+           restrict_dismissals             = false
        }
    }

  # module.github_repository["wfm.wfm-10"].github_branch_protection.branch["master"] will be created
+   resource "github_branch_protection" "branch" {
+       allows_deletions                = false
+       allows_force_pushes             = false
+       enforce_admins                  = false
+       id                              = (known after apply)
+       pattern                         = "master"
+       repository_id                   = (known after apply)
+       require_conversation_resolution = false
+       require_signed_commits          = false
+       required_linear_history         = false

+       required_pull_request_reviews {
+           dismiss_stale_reviews           = false
+           require_code_owner_reviews      = false
+           required_approving_review_count = 2
+           restrict_dismissals             = false
        }
    }

  # module.github_repository["wfm.wfm-10"].github_repository.repo will be created
+   resource "github_repository" "repo" {
+       allow_auto_merge       = false
+       allow_merge_commit     = true
+       allow_rebase_merge     = true
+       allow_squash_merge     = true
+       archived               = false
+       auto_init              = true
+       branches               = (known after apply)
+       default_branch         = (known after apply)
+       delete_branch_on_merge = false
+       etag                   = (known after apply)
+       full_name              = (known after apply)
+       git_clone_url          = (known after apply)
+       has_downloads          = false
+       has_issues             = false
+       has_projects           = false
+       has_wiki               = false
+       html_url               = (known after apply)
+       http_clone_url         = (known after apply)
+       id                     = (known after apply)
+       is_template            = false
+       name                   = "wfm-10"
+       node_id                = (known after apply)
+       private                = (known after apply)
+       repo_id                = (known after apply)
+       ssh_clone_url          = (known after apply)
+       svn_url                = (known after apply)
+       visibility             = "public"
+       vulnerability_alerts   = true
    }

  # module.github_repository["wfm.wfm-11"].github_branch_protection.branch["develop"] will be created
+   resource "github_branch_protection" "branch" {
+       allows_deletions                = false
+       allows_force_pushes             = false
+       enforce_admins                  = false
+       id                              = (known after apply)
+       pattern                         = "develop"
+       repository_id                   = (known after apply)
+       require_conversation_resolution = false
+       require_signed_commits          = false
+       required_linear_history         = false

+       required_pull_request_reviews {
+           dismiss_stale_reviews           = false
+           require_code_owner_reviews      = false
+           required_approving_review_count = 2
+           restrict_dismissals             = false
        }
    }

  # module.github_repository["wfm.wfm-11"].github_branch_protection.branch["main"] will be created
+   resource "github_branch_protection" "branch" {
+       allows_deletions                = false
+       allows_force_pushes             = false
+       enforce_admins                  = false
+       id                              = (known after apply)
+       pattern                         = "main"
+       repository_id                   = (known after apply)
+       require_conversation_resolution = false
+       require_signed_commits          = false
+       required_linear_history         = false

+       required_pull_request_reviews {
+           dismiss_stale_reviews           = false
+           require_code_owner_reviews      = false
+           required_approving_review_count = 2
+           restrict_dismissals             = false
        }
    }

  # module.github_repository["wfm.wfm-11"].github_branch_protection.branch["master"] will be created
+   resource "github_branch_protection" "branch" {
+       allows_deletions                = false
+       allows_force_pushes             = false
+       enforce_admins                  = false
+       id                              = (known after apply)
+       pattern                         = "master"
+       repository_id                   = (known after apply)
+       require_conversation_resolution = false
+       require_signed_commits          = false
+       required_linear_history         = false

+       required_pull_request_reviews {
+           dismiss_stale_reviews           = false
+           require_code_owner_reviews      = false
+           required_approving_review_count = 2
+           restrict_dismissals             = false
        }
    }

  # module.github_repository["wfm.wfm-11"].github_repository.repo will be created
+   resource "github_repository" "repo" {
+       allow_auto_merge       = false
+       allow_merge_commit     = true
+       allow_rebase_merge     = true
+       allow_squash_merge     = true
+       archived               = false
+       auto_init              = true
+       branches               = (known after apply)
+       default_branch         = (known after apply)
+       delete_branch_on_merge = false
+       etag                   = (known after apply)
+       full_name              = (known after apply)
+       git_clone_url          = (known after apply)
+       has_downloads          = false
+       has_issues             = false
+       has_projects           = false
+       has_wiki               = false
+       html_url               = (known after apply)
+       http_clone_url         = (known after apply)
+       id                     = (known after apply)
+       is_template            = false
+       name                   = "wfm-11"
+       node_id                = (known after apply)
+       private                = (known after apply)
+       repo_id                = (known after apply)
+       ssh_clone_url          = (known after apply)
+       svn_url                = (known after apply)
+       visibility             = "public"
+       vulnerability_alerts   = true
    }

  # module.github_repository["wfm.wfm-2"].github_branch_protection.branch["develop"] will be created
+   resource "github_branch_protection" "branch" {
+       allows_deletions                = false
+       allows_force_pushes             = false
+       enforce_admins                  = false
+       id                              = (known after apply)
+       pattern                         = "develop"
+       repository_id                   = (known after apply)
+       require_conversation_resolution = false
+       require_signed_commits          = false
+       required_linear_history         = false

+       required_pull_request_reviews {
+           dismiss_stale_reviews           = false
+           require_code_owner_reviews      = false
+           required_approving_review_count = 2
+           restrict_dismissals             = false
        }
    }

  # module.github_repository["wfm.wfm-2"].github_branch_protection.branch["main"] will be created
+   resource "github_branch_protection" "branch" {
+       allows_deletions                = false
+       allows_force_pushes             = false
+       enforce_admins                  = false
+       id                              = (known after apply)
+       pattern                         = "main"
+       repository_id                   = (known after apply)
+       require_conversation_resolution = false
+       require_signed_commits          = false
+       required_linear_history         = false

+       required_pull_request_reviews {
+           dismiss_stale_reviews           = false
+           require_code_owner_reviews      = false
+           required_approving_review_count = 2
+           restrict_dismissals             = false
        }
    }

  # module.github_repository["wfm.wfm-2"].github_branch_protection.branch["master"] will be created
+   resource "github_branch_protection" "branch" {
+       allows_deletions                = false
+       allows_force_pushes             = false
+       enforce_admins                  = false
+       id                              = (known after apply)
+       pattern                         = "master"
+       repository_id                   = (known after apply)
+       require_conversation_resolution = false
+       require_signed_commits          = false
+       required_linear_history         = false

+       required_pull_request_reviews {
+           dismiss_stale_reviews           = false
+           require_code_owner_reviews      = false
+           required_approving_review_count = 2
+           restrict_dismissals             = false
        }
    }

  # module.github_repository["wfm.wfm-2"].github_repository.repo will be created
+   resource "github_repository" "repo" {
+       allow_auto_merge       = false
+       allow_merge_commit     = true
+       allow_rebase_merge     = true
+       allow_squash_merge     = true
+       archived               = false
+       auto_init              = true
+       branches               = (known after apply)
+       default_branch         = (known after apply)
+       delete_branch_on_merge = false
+       etag                   = (known after apply)
+       full_name              = (known after apply)
+       git_clone_url          = (known after apply)
+       has_downloads          = false
+       has_issues             = false
+       has_projects           = false
+       has_wiki               = false
+       html_url               = (known after apply)
+       http_clone_url         = (known after apply)
+       id                     = (known after apply)
+       is_template            = false
+       name                   = "wfm-2"
+       node_id                = (known after apply)
+       private                = (known after apply)
+       repo_id                = (known after apply)
+       ssh_clone_url          = (known after apply)
+       svn_url                = (known after apply)
+       visibility             = "public"
+       vulnerability_alerts   = true
    }

  # module.github_repository["wfm.wfm-4"].github_branch_protection.branch["develop"] will be created
+   resource "github_branch_protection" "branch" {
+       allows_deletions                = false
+       allows_force_pushes             = false
+       enforce_admins                  = false
+       id                              = (known after apply)
+       pattern                         = "develop"
+       repository_id                   = (known after apply)
+       require_conversation_resolution = false
+       require_signed_commits          = false
+       required_linear_history         = false

+       required_pull_request_reviews {
+           dismiss_stale_reviews           = false
+           require_code_owner_reviews      = false
+           required_approving_review_count = 2
+           restrict_dismissals             = false
        }
    }

  # module.github_repository["wfm.wfm-4"].github_branch_protection.branch["main"] will be created
+   resource "github_branch_protection" "branch" {
+       allows_deletions                = false
+       allows_force_pushes             = false
+       enforce_admins                  = false
+       id                              = (known after apply)
+       pattern                         = "main"
+       repository_id                   = (known after apply)
+       require_conversation_resolution = false
+       require_signed_commits          = false
+       required_linear_history         = false

+       required_pull_request_reviews {
+           dismiss_stale_reviews           = false
+           require_code_owner_reviews      = false
+           required_approving_review_count = 2
+           restrict_dismissals             = false
        }
    }

  # module.github_repository["wfm.wfm-4"].github_branch_protection.branch["master"] will be created
+   resource "github_branch_protection" "branch" {
+       allows_deletions                = false
+       allows_force_pushes             = false
+       enforce_admins                  = false
+       id                              = (known after apply)
+       pattern                         = "master"
+       repository_id                   = (known after apply)
+       require_conversation_resolution = false
+       require_signed_commits          = false
+       required_linear_history         = false

+       required_pull_request_reviews {
+           dismiss_stale_reviews           = false
+           require_code_owner_reviews      = false
+           required_approving_review_count = 2
+           restrict_dismissals             = false
        }
    }

  # module.github_repository["wfm.wfm-4"].github_repository.repo will be created
+   resource "github_repository" "repo" {
+       allow_auto_merge       = false
+       allow_merge_commit     = true
+       allow_rebase_merge     = true
+       allow_squash_merge     = true
+       archived               = false
+       auto_init              = true
+       branches               = (known after apply)
+       default_branch         = (known after apply)
+       delete_branch_on_merge = false
+       etag                   = (known after apply)
+       full_name              = (known after apply)
+       git_clone_url          = (known after apply)
+       has_downloads          = false
+       has_issues             = false
+       has_projects           = false
+       has_wiki               = false
+       html_url               = (known after apply)
+       http_clone_url         = (known after apply)
+       id                     = (known after apply)
+       is_template            = false
+       name                   = "wfm-4"
+       node_id                = (known after apply)
+       private                = (known after apply)
+       repo_id                = (known after apply)
+       ssh_clone_url          = (known after apply)
+       svn_url                = (known after apply)
+       visibility             = "public"
+       vulnerability_alerts   = true
    }

  # module.github_repository["wfm.wfm-test-import"].github_branch_protection.branch["develop"] will be created
+   resource "github_branch_protection" "branch" {
+       allows_deletions                = false
+       allows_force_pushes             = false
+       enforce_admins                  = false
+       id                              = (known after apply)
+       pattern                         = "develop"
+       repository_id                   = (known after apply)
+       require_conversation_resolution = false
+       require_signed_commits          = false
+       required_linear_history         = false

+       required_pull_request_reviews {
+           dismiss_stale_reviews           = false
+           require_code_owner_reviews      = false
+           required_approving_review_count = 2
+           restrict_dismissals             = false
        }
    }

  # module.github_repository["wfm.wfm-test-import"].github_branch_protection.branch["main"] will be created
+   resource "github_branch_protection" "branch" {
+       allows_deletions                = false
+       allows_force_pushes             = false
+       enforce_admins                  = false
+       id                              = (known after apply)
+       pattern                         = "main"
+       repository_id   
```
</details>